MikroElektronika/core_packages/PIC/XC8/def/PIC18F2331/mcu.h
// Register: CAP1CON
#define CAP1CON CAP1CON
extern volatile unsigned char           CAP1CON             __at(0xF63);
#ifndef _LIB_BUILD
asm("CAP1CON equ 0F63h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CAP1M                  :4;
        unsigned                        :1;
        unsigned CAP1TMR                :1;
        unsigned CAP1REN                :1;
    };
    struct {
        unsigned CAP1M0                 :1;
        unsigned CAP1M1                 :1;
        unsigned CAP1M2                 :1;
        unsigned CAP1M3                 :1;
    };
} CAP1CONbits_t;
extern volatile CAP1CONbits_t CAP1CONbits __at(0xF63);
// bitfield macros
#define _CAP1CON_CAP1M_POSN                                 0x0
#define _CAP1CON_CAP1M_POSITION                             0x0
#define _CAP1CON_CAP1M_SIZE                                 0x4
#define _CAP1CON_CAP1M_LENGTH                               0x4
#define _CAP1CON_CAP1M_MASK                                 0xF
#define _CAP1CON_CAP1TMR_POSN                               0x5
#define _CAP1CON_CAP1TMR_POSITION                           0x5
#define _CAP1CON_CAP1TMR_SIZE                               0x1
#define _CAP1CON_CAP1TMR_LENGTH                             0x1
#define _CAP1CON_CAP1TMR_MASK                               0x20
#define _CAP1CON_CAP1REN_POSN                               0x6
#define _CAP1CON_CAP1REN_POSITION                           0x6
#define _CAP1CON_CAP1REN_SIZE                               0x1
#define _CAP1CON_CAP1REN_LENGTH                             0x1
#define _CAP1CON_CAP1REN_MASK                               0x40
#define _CAP1CON_CAP1M0_POSN                                0x0
#define _CAP1CON_CAP1M0_POSITION                            0x0
#define _CAP1CON_CAP1M0_SIZE                                0x1
#define _CAP1CON_CAP1M0_LENGTH                              0x1
#define _CAP1CON_CAP1M0_MASK                                0x1
#define _CAP1CON_CAP1M1_POSN                                0x1
#define _CAP1CON_CAP1M1_POSITION                            0x1
#define _CAP1CON_CAP1M1_SIZE                                0x1
#define _CAP1CON_CAP1M1_LENGTH                              0x1
#define _CAP1CON_CAP1M1_MASK                                0x2
#define _CAP1CON_CAP1M2_POSN                                0x2
#define _CAP1CON_CAP1M2_POSITION                            0x2
#define _CAP1CON_CAP1M2_SIZE                                0x1
#define _CAP1CON_CAP1M2_LENGTH                              0x1
#define _CAP1CON_CAP1M2_MASK                                0x4
#define _CAP1CON_CAP1M3_POSN                                0x3
#define _CAP1CON_CAP1M3_POSITION                            0x3
#define _CAP1CON_CAP1M3_SIZE                                0x1
#define _CAP1CON_CAP1M3_LENGTH                              0x1
#define _CAP1CON_CAP1M3_MASK                                0x8

// Register: CAP3BUFL
#define CAP3BUFL CAP3BUFL
extern volatile unsigned char           CAP3BUFL            __at(0xF64);
#ifndef _LIB_BUILD
asm("CAP3BUFL equ 0F64h");
#endif
// aliases
extern volatile unsigned char           MAXCNTL             __at(0xF64);
#ifndef _LIB_BUILD
asm("MAXCNTL equ 0F64h");
#endif

// Register: CAP3BUFH
#define CAP3BUFH CAP3BUFH
extern volatile unsigned char           CAP3BUFH            __at(0xF65);
#ifndef _LIB_BUILD
asm("CAP3BUFH equ 0F65h");
#endif
// aliases
extern volatile unsigned char           MAXCNTH             __at(0xF65);
#ifndef _LIB_BUILD
asm("MAXCNTH equ 0F65h");
#endif

// Register: CAP2BUFL
#define CAP2BUFL CAP2BUFL
extern volatile unsigned char           CAP2BUFL            __at(0xF66);
#ifndef _LIB_BUILD
asm("CAP2BUFL equ 0F66h");
#endif
// aliases
extern volatile unsigned char           POSCNTL             __at(0xF66);
#ifndef _LIB_BUILD
asm("POSCNTL equ 0F66h");
#endif

// Register: CAP2BUFH
#define CAP2BUFH CAP2BUFH
extern volatile unsigned char           CAP2BUFH            __at(0xF67);
#ifndef _LIB_BUILD
asm("CAP2BUFH equ 0F67h");
#endif
// aliases
extern volatile unsigned char           POSCNTH             __at(0xF67);
#ifndef _LIB_BUILD
asm("POSCNTH equ 0F67h");
#endif

// Register: CAP1BUFL
#define CAP1BUFL CAP1BUFL
extern volatile unsigned char           CAP1BUFL            __at(0xF68);
#ifndef _LIB_BUILD
asm("CAP1BUFL equ 0F68h");
#endif
// aliases
extern volatile unsigned char           VELRL               __at(0xF68);
#ifndef _LIB_BUILD
asm("VELRL equ 0F68h");
#endif

// Register: CAP1BUFH
#define CAP1BUFH CAP1BUFH
extern volatile unsigned char           CAP1BUFH            __at(0xF69);
#ifndef _LIB_BUILD
asm("CAP1BUFH equ 0F69h");
#endif
// aliases
extern volatile unsigned char           VELRH               __at(0xF69);
#ifndef _LIB_BUILD
asm("VELRH equ 0F69h");
#endif

// Register: OVDCONS
#define OVDCONS OVDCONS
extern volatile unsigned char           OVDCONS             __at(0xF6A);
#ifndef _LIB_BUILD
asm("OVDCONS equ 0F6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POUT                   :8;
    };
    struct {
        unsigned POUT0                  :1;
        unsigned POUT1                  :1;
        unsigned POUT2                  :1;
        unsigned POUT3                  :1;
        unsigned POUT4                  :1;
        unsigned POUT5                  :1;
        unsigned POUT6                  :1;
        unsigned POUT7                  :1;
    };
} OVDCONSbits_t;
extern volatile OVDCONSbits_t OVDCONSbits __at(0xF6A);
// bitfield macros
#define _OVDCONS_POUT_POSN                                  0x0
#define _OVDCONS_POUT_POSITION                              0x0
#define _OVDCONS_POUT_SIZE                                  0x8
#define _OVDCONS_POUT_LENGTH                                0x8
#define _OVDCONS_POUT_MASK                                  0xFF
#define _OVDCONS_POUT0_POSN                                 0x0
#define _OVDCONS_POUT0_POSITION                             0x0
#define _OVDCONS_POUT0_SIZE                                 0x1
#define _OVDCONS_POUT0_LENGTH                               0x1
#define _OVDCONS_POUT0_MASK                                 0x1
#define _OVDCONS_POUT1_POSN                                 0x1
#define _OVDCONS_POUT1_POSITION                             0x1
#define _OVDCONS_POUT1_SIZE                                 0x1
#define _OVDCONS_POUT1_LENGTH                               0x1
#define _OVDCONS_POUT1_MASK                                 0x2
#define _OVDCONS_POUT2_POSN                                 0x2
#define _OVDCONS_POUT2_POSITION                             0x2
#define _OVDCONS_POUT2_SIZE                                 0x1
#define _OVDCONS_POUT2_LENGTH                               0x1
#define _OVDCONS_POUT2_MASK                                 0x4
#define _OVDCONS_POUT3_POSN                                 0x3
#define _OVDCONS_POUT3_POSITION                             0x3
#define _OVDCONS_POUT3_SIZE                                 0x1
#define _OVDCONS_POUT3_LENGTH                               0x1
#define _OVDCONS_POUT3_MASK                                 0x8
#define _OVDCONS_POUT4_POSN                                 0x4
#define _OVDCONS_POUT4_POSITION                             0x4
#define _OVDCONS_POUT4_SIZE                                 0x1
#define _OVDCONS_POUT4_LENGTH                               0x1
#define _OVDCONS_POUT4_MASK                                 0x10
#define _OVDCONS_POUT5_POSN                                 0x5
#define _OVDCONS_POUT5_POSITION                             0x5
#define _OVDCONS_POUT5_SIZE                                 0x1
#define _OVDCONS_POUT5_LENGTH                               0x1
#define _OVDCONS_POUT5_MASK                                 0x20
#define _OVDCONS_POUT6_POSN                                 0x6
#define _OVDCONS_POUT6_POSITION                             0x6
#define _OVDCONS_POUT6_SIZE                                 0x1
#define _OVDCONS_POUT6_LENGTH                               0x1
#define _OVDCONS_POUT6_MASK                                 0x40
#define _OVDCONS_POUT7_POSN                                 0x7
#define _OVDCONS_POUT7_POSITION                             0x7
#define _OVDCONS_POUT7_SIZE                                 0x1
#define _OVDCONS_POUT7_LENGTH                               0x1
#define _OVDCONS_POUT7_MASK                                 0x80

// Register: OVDCOND
#define OVDCOND OVDCOND
extern volatile unsigned char           OVDCOND             __at(0xF6B);
#ifndef _LIB_BUILD
asm("OVDCOND equ 0F6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POVD                   :8;
    };
    struct {
        unsigned POVD0                  :1;
        unsigned POVD1                  :1;
        unsigned POVD2                  :1;
        unsigned POVD3                  :1;
        unsigned POVD4                  :1;
        unsigned POVD5                  :1;
        unsigned POVD6                  :1;
        unsigned POVD7                  :1;
    };
} OVDCONDbits_t;
extern volatile OVDCONDbits_t OVDCONDbits __at(0xF6B);
// bitfield macros
#define _OVDCOND_POVD_POSN                                  0x0
#define _OVDCOND_POVD_POSITION                              0x0
#define _OVDCOND_POVD_SIZE                                  0x8
#define _OVDCOND_POVD_LENGTH                                0x8
#define _OVDCOND_POVD_MASK                                  0xFF
#define _OVDCOND_POVD0_POSN                                 0x0
#define _OVDCOND_POVD0_POSITION                             0x0
#define _OVDCOND_POVD0_SIZE                                 0x1
#define _OVDCOND_POVD0_LENGTH                               0x1
#define _OVDCOND_POVD0_MASK                                 0x1
#define _OVDCOND_POVD1_POSN                                 0x1
#define _OVDCOND_POVD1_POSITION                             0x1
#define _OVDCOND_POVD1_SIZE                                 0x1
#define _OVDCOND_POVD1_LENGTH                               0x1
#define _OVDCOND_POVD1_MASK                                 0x2
#define _OVDCOND_POVD2_POSN                                 0x2
#define _OVDCOND_POVD2_POSITION                             0x2
#define _OVDCOND_POVD2_SIZE                                 0x1
#define _OVDCOND_POVD2_LENGTH                               0x1
#define _OVDCOND_POVD2_MASK                                 0x4
#define _OVDCOND_POVD3_POSN                                 0x3
#define _OVDCOND_POVD3_POSITION                             0x3
#define _OVDCOND_POVD3_SIZE                                 0x1
#define _OVDCOND_POVD3_LENGTH                               0x1
#define _OVDCOND_POVD3_MASK                                 0x8
#define _OVDCOND_POVD4_POSN                                 0x4
#define _OVDCOND_POVD4_POSITION                             0x4
#define _OVDCOND_POVD4_SIZE                                 0x1
#define _OVDCOND_POVD4_LENGTH                               0x1
#define _OVDCOND_POVD4_MASK                                 0x10
#define _OVDCOND_POVD5_POSN                                 0x5
#define _OVDCOND_POVD5_POSITION                             0x5
#define _OVDCOND_POVD5_SIZE                                 0x1
#define _OVDCOND_POVD5_LENGTH                               0x1
#define _OVDCOND_POVD5_MASK                                 0x20
#define _OVDCOND_POVD6_POSN                                 0x6
#define _OVDCOND_POVD6_POSITION                             0x6
#define _OVDCOND_POVD6_SIZE                                 0x1
#define _OVDCOND_POVD6_LENGTH                               0x1
#define _OVDCOND_POVD6_MASK                                 0x40
#define _OVDCOND_POVD7_POSN                                 0x7
#define _OVDCOND_POVD7_POSITION                             0x7
#define _OVDCOND_POVD7_SIZE                                 0x1
#define _OVDCOND_POVD7_LENGTH                               0x1
#define _OVDCOND_POVD7_MASK                                 0x80

// Register: FLTCONFIG
#define FLTCONFIG FLTCONFIG
extern volatile unsigned char           FLTCONFIG           __at(0xF6C);
#ifndef _LIB_BUILD
asm("FLTCONFIG equ 0F6Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FLTAEN                 :1;
        unsigned FLTAMOD                :1;
        unsigned FLTAS                  :1;
        unsigned FLTCON                 :1;
        unsigned FLTBEN                 :1;
        unsigned FLTBMOD                :1;
        unsigned FLTBS                  :1;
        unsigned BRFEN                  :1;
    };
} FLTCONFIGbits_t;
extern volatile FLTCONFIGbits_t FLTCONFIGbits __at(0xF6C);
// bitfield macros
#define _FLTCONFIG_FLTAEN_POSN                              0x0
#define _FLTCONFIG_FLTAEN_POSITION                          0x0
#define _FLTCONFIG_FLTAEN_SIZE                              0x1
#define _FLTCONFIG_FLTAEN_LENGTH                            0x1
#define _FLTCONFIG_FLTAEN_MASK                              0x1
#define _FLTCONFIG_FLTAMOD_POSN                             0x1
#define _FLTCONFIG_FLTAMOD_POSITION                         0x1
#define _FLTCONFIG_FLTAMOD_SIZE                             0x1
#define _FLTCONFIG_FLTAMOD_LENGTH                           0x1
#define _FLTCONFIG_FLTAMOD_MASK                             0x2
#define _FLTCONFIG_FLTAS_POSN                               0x2
#define _FLTCONFIG_FLTAS_POSITION                           0x2
#define _FLTCONFIG_FLTAS_SIZE                               0x1
#define _FLTCONFIG_FLTAS_LENGTH                             0x1
#define _FLTCONFIG_FLTAS_MASK                               0x4
#define _FLTCONFIG_FLTCON_POSN                              0x3
#define _FLTCONFIG_FLTCON_POSITION                          0x3
#define _FLTCONFIG_FLTCON_SIZE                              0x1
#define _FLTCONFIG_FLTCON_LENGTH                            0x1
#define _FLTCONFIG_FLTCON_MASK                              0x8
#define _FLTCONFIG_FLTBEN_POSN                              0x4
#define _FLTCONFIG_FLTBEN_POSITION                          0x4
#define _FLTCONFIG_FLTBEN_SIZE                              0x1
#define _FLTCONFIG_FLTBEN_LENGTH                            0x1
#define _FLTCONFIG_FLTBEN_MASK                              0x10
#define _FLTCONFIG_FLTBMOD_POSN                             0x5
#define _FLTCONFIG_FLTBMOD_POSITION                         0x5
#define _FLTCONFIG_FLTBMOD_SIZE                             0x1
#define _FLTCONFIG_FLTBMOD_LENGTH                           0x1
#define _FLTCONFIG_FLTBMOD_MASK                             0x20
#define _FLTCONFIG_FLTBS_POSN                               0x6
#define _FLTCONFIG_FLTBS_POSITION                           0x6
#define _FLTCONFIG_FLTBS_SIZE                               0x1
#define _FLTCONFIG_FLTBS_LENGTH                             0x1
#define _FLTCONFIG_FLTBS_MASK                               0x40
#define _FLTCONFIG_BRFEN_POSN                               0x7
#define _FLTCONFIG_BRFEN_POSITION                           0x7
#define _FLTCONFIG_BRFEN_SIZE                               0x1
#define _FLTCONFIG_BRFEN_LENGTH                             0x1
#define _FLTCONFIG_BRFEN_MASK                               0x80

// Register: DTCON
#define DTCON DTCON
extern volatile unsigned char           DTCON               __at(0xF6D);
#ifndef _LIB_BUILD
asm("DTCON equ 0F6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DTA                    :6;
        unsigned DTAPS                  :2;
    };
    struct {
        unsigned DT0                    :1;
        unsigned DT1                    :1;
        unsigned DT2                    :1;
        unsigned DT3                    :1;
        unsigned DT4                    :1;
        unsigned DT5                    :1;
        unsigned DTPS0                  :1;
        unsigned DTPS1                  :1;
    };
    struct {
        unsigned DTA0                   :1;
        unsigned DTA1                   :1;
        unsigned DTA2                   :1;
        unsigned DTA3                   :1;
        unsigned DTA4                   :1;
        unsigned DTA5                   :1;
        unsigned DTAPS0                 :1;
        unsigned DTAPS1                 :1;
    };
} DTCONbits_t;
