MikroElektronika/core_packages/PIC/XC8/def/PIC18F2331/mcu.h
extern volatile TRISCbits_t TRISCbits __at(0xF94);
// bitfield macros
#define _TRISC_TRISC0_POSN                                  0x0
#define _TRISC_TRISC0_POSITION                              0x0
#define _TRISC_TRISC0_SIZE                                  0x1
#define _TRISC_TRISC0_LENGTH                                0x1
#define _TRISC_TRISC0_MASK                                  0x1
#define _TRISC_TRISC1_POSN                                  0x1
#define _TRISC_TRISC1_POSITION                              0x1
#define _TRISC_TRISC1_SIZE                                  0x1
#define _TRISC_TRISC1_LENGTH                                0x1
#define _TRISC_TRISC1_MASK                                  0x2
#define _TRISC_TRISC2_POSN                                  0x2
#define _TRISC_TRISC2_POSITION                              0x2
#define _TRISC_TRISC2_SIZE                                  0x1
#define _TRISC_TRISC2_LENGTH                                0x1
#define _TRISC_TRISC2_MASK                                  0x4
#define _TRISC_TRISC3_POSN                                  0x3
#define _TRISC_TRISC3_POSITION                              0x3
#define _TRISC_TRISC3_SIZE                                  0x1
#define _TRISC_TRISC3_LENGTH                                0x1
#define _TRISC_TRISC3_MASK                                  0x8
#define _TRISC_TRISC4_POSN                                  0x4
#define _TRISC_TRISC4_POSITION                              0x4
#define _TRISC_TRISC4_SIZE                                  0x1
#define _TRISC_TRISC4_LENGTH                                0x1
#define _TRISC_TRISC4_MASK                                  0x10
#define _TRISC_TRISC5_POSN                                  0x5
#define _TRISC_TRISC5_POSITION                              0x5
#define _TRISC_TRISC5_SIZE                                  0x1
#define _TRISC_TRISC5_LENGTH                                0x1
#define _TRISC_TRISC5_MASK                                  0x20
#define _TRISC_TRISC6_POSN                                  0x6
#define _TRISC_TRISC6_POSITION                              0x6
#define _TRISC_TRISC6_SIZE                                  0x1
#define _TRISC_TRISC6_LENGTH                                0x1
#define _TRISC_TRISC6_MASK                                  0x40
#define _TRISC_TRISC7_POSN                                  0x7
#define _TRISC_TRISC7_POSITION                              0x7
#define _TRISC_TRISC7_SIZE                                  0x1
#define _TRISC_TRISC7_LENGTH                                0x1
#define _TRISC_TRISC7_MASK                                  0x80
#define _TRISC_RC0_POSN                                     0x0
#define _TRISC_RC0_POSITION                                 0x0
#define _TRISC_RC0_SIZE                                     0x1
#define _TRISC_RC0_LENGTH                                   0x1
#define _TRISC_RC0_MASK                                     0x1
#define _TRISC_RC1_POSN                                     0x1
#define _TRISC_RC1_POSITION                                 0x1
#define _TRISC_RC1_SIZE                                     0x1
#define _TRISC_RC1_LENGTH                                   0x1
#define _TRISC_RC1_MASK                                     0x2
#define _TRISC_RC2_POSN                                     0x2
#define _TRISC_RC2_POSITION                                 0x2
#define _TRISC_RC2_SIZE                                     0x1
#define _TRISC_RC2_LENGTH                                   0x1
#define _TRISC_RC2_MASK                                     0x4
#define _TRISC_RC3_POSN                                     0x3
#define _TRISC_RC3_POSITION                                 0x3
#define _TRISC_RC3_SIZE                                     0x1
#define _TRISC_RC3_LENGTH                                   0x1
#define _TRISC_RC3_MASK                                     0x8
#define _TRISC_RC4_POSN                                     0x4
#define _TRISC_RC4_POSITION                                 0x4
#define _TRISC_RC4_SIZE                                     0x1
#define _TRISC_RC4_LENGTH                                   0x1
#define _TRISC_RC4_MASK                                     0x10
#define _TRISC_RC5_POSN                                     0x5
#define _TRISC_RC5_POSITION                                 0x5
#define _TRISC_RC5_SIZE                                     0x1
#define _TRISC_RC5_LENGTH                                   0x1
#define _TRISC_RC5_MASK                                     0x20
#define _TRISC_RC6_POSN                                     0x6
#define _TRISC_RC6_POSITION                                 0x6
#define _TRISC_RC6_SIZE                                     0x1
#define _TRISC_RC6_LENGTH                                   0x1
#define _TRISC_RC6_MASK                                     0x40
#define _TRISC_RC7_POSN                                     0x7
#define _TRISC_RC7_POSITION                                 0x7
#define _TRISC_RC7_SIZE                                     0x1
#define _TRISC_RC7_LENGTH                                   0x1
#define _TRISC_RC7_MASK                                     0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned TRISC0                 :1;
        unsigned TRISC1                 :1;
        unsigned TRISC2                 :1;
        unsigned TRISC3                 :1;
        unsigned TRISC4                 :1;
        unsigned TRISC5                 :1;
        unsigned TRISC6                 :1;
        unsigned TRISC7                 :1;
    };
    struct {
        unsigned RC0                    :1;
        unsigned RC1                    :1;
        unsigned RC2                    :1;
        unsigned RC3                    :1;
        unsigned RC4                    :1;
        unsigned RC5                    :1;
        unsigned RC6                    :1;
        unsigned RC7                    :1;
    };
} DDRCbits_t;
extern volatile DDRCbits_t DDRCbits __at(0xF94);
// bitfield macros
#define _DDRC_TRISC0_POSN                                   0x0
#define _DDRC_TRISC0_POSITION                               0x0
#define _DDRC_TRISC0_SIZE                                   0x1
#define _DDRC_TRISC0_LENGTH                                 0x1
#define _DDRC_TRISC0_MASK                                   0x1
#define _DDRC_TRISC1_POSN                                   0x1
#define _DDRC_TRISC1_POSITION                               0x1
#define _DDRC_TRISC1_SIZE                                   0x1
#define _DDRC_TRISC1_LENGTH                                 0x1
#define _DDRC_TRISC1_MASK                                   0x2
#define _DDRC_TRISC2_POSN                                   0x2
#define _DDRC_TRISC2_POSITION                               0x2
#define _DDRC_TRISC2_SIZE                                   0x1
#define _DDRC_TRISC2_LENGTH                                 0x1
#define _DDRC_TRISC2_MASK                                   0x4
#define _DDRC_TRISC3_POSN                                   0x3
#define _DDRC_TRISC3_POSITION                               0x3
#define _DDRC_TRISC3_SIZE                                   0x1
#define _DDRC_TRISC3_LENGTH                                 0x1
#define _DDRC_TRISC3_MASK                                   0x8
#define _DDRC_TRISC4_POSN                                   0x4
#define _DDRC_TRISC4_POSITION                               0x4
#define _DDRC_TRISC4_SIZE                                   0x1
#define _DDRC_TRISC4_LENGTH                                 0x1
#define _DDRC_TRISC4_MASK                                   0x10
#define _DDRC_TRISC5_POSN                                   0x5
#define _DDRC_TRISC5_POSITION                               0x5
#define _DDRC_TRISC5_SIZE                                   0x1
#define _DDRC_TRISC5_LENGTH                                 0x1
#define _DDRC_TRISC5_MASK                                   0x20
#define _DDRC_TRISC6_POSN                                   0x6
#define _DDRC_TRISC6_POSITION                               0x6
#define _DDRC_TRISC6_SIZE                                   0x1
#define _DDRC_TRISC6_LENGTH                                 0x1
#define _DDRC_TRISC6_MASK                                   0x40
#define _DDRC_TRISC7_POSN                                   0x7
#define _DDRC_TRISC7_POSITION                               0x7
#define _DDRC_TRISC7_SIZE                                   0x1
#define _DDRC_TRISC7_LENGTH                                 0x1
#define _DDRC_TRISC7_MASK                                   0x80
#define _DDRC_RC0_POSN                                      0x0
#define _DDRC_RC0_POSITION                                  0x0
#define _DDRC_RC0_SIZE                                      0x1
#define _DDRC_RC0_LENGTH                                    0x1
#define _DDRC_RC0_MASK                                      0x1
#define _DDRC_RC1_POSN                                      0x1
#define _DDRC_RC1_POSITION                                  0x1
#define _DDRC_RC1_SIZE                                      0x1
#define _DDRC_RC1_LENGTH                                    0x1
#define _DDRC_RC1_MASK                                      0x2
#define _DDRC_RC2_POSN                                      0x2
#define _DDRC_RC2_POSITION                                  0x2
#define _DDRC_RC2_SIZE                                      0x1
#define _DDRC_RC2_LENGTH                                    0x1
#define _DDRC_RC2_MASK                                      0x4
#define _DDRC_RC3_POSN                                      0x3
#define _DDRC_RC3_POSITION                                  0x3
#define _DDRC_RC3_SIZE                                      0x1
#define _DDRC_RC3_LENGTH                                    0x1
#define _DDRC_RC3_MASK                                      0x8
#define _DDRC_RC4_POSN                                      0x4
#define _DDRC_RC4_POSITION                                  0x4
#define _DDRC_RC4_SIZE                                      0x1
#define _DDRC_RC4_LENGTH                                    0x1
#define _DDRC_RC4_MASK                                      0x10
#define _DDRC_RC5_POSN                                      0x5
#define _DDRC_RC5_POSITION                                  0x5
#define _DDRC_RC5_SIZE                                      0x1
#define _DDRC_RC5_LENGTH                                    0x1
#define _DDRC_RC5_MASK                                      0x20
#define _DDRC_RC6_POSN                                      0x6
#define _DDRC_RC6_POSITION                                  0x6
#define _DDRC_RC6_SIZE                                      0x1
#define _DDRC_RC6_LENGTH                                    0x1
#define _DDRC_RC6_MASK                                      0x40
#define _DDRC_RC7_POSN                                      0x7
#define _DDRC_RC7_POSITION                                  0x7
#define _DDRC_RC7_SIZE                                      0x1
#define _DDRC_RC7_LENGTH                                    0x1
#define _DDRC_RC7_MASK                                      0x80

// Register: ADCHS
#define ADCHS ADCHS
extern volatile unsigned char           ADCHS               __at(0xF99);
#ifndef _LIB_BUILD
asm("ADCHS equ 0F99h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SASEL                  :2;
        unsigned SCSEL                  :2;
        unsigned SBSEL                  :2;
        unsigned SDSEL                  :2;
    };
    struct {
        unsigned GASEL0                 :1;
        unsigned GASEL1                 :1;
        unsigned GCSEL0                 :1;
        unsigned GCSEL1                 :1;
        unsigned GBSEL0                 :1;
        unsigned GBSEL1                 :1;
        unsigned GDSEL0                 :1;
        unsigned GDSEL1                 :1;
    };
    struct {
        unsigned SASEL0                 :1;
        unsigned SASEL1                 :1;
        unsigned SCSEL0                 :1;
        unsigned SCSEL1                 :1;
        unsigned SBSEL0                 :1;
        unsigned SBSEL1                 :1;
        unsigned SDSEL0                 :1;
        unsigned SDSEL1                 :1;
    };
} ADCHSbits_t;
extern volatile ADCHSbits_t ADCHSbits __at(0xF99);
// bitfield macros
#define _ADCHS_SASEL_POSN                                   0x0
#define _ADCHS_SASEL_POSITION                               0x0
#define _ADCHS_SASEL_SIZE                                   0x2
#define _ADCHS_SASEL_LENGTH                                 0x2
#define _ADCHS_SASEL_MASK                                   0x3
#define _ADCHS_SCSEL_POSN                                   0x2
#define _ADCHS_SCSEL_POSITION                               0x2
#define _ADCHS_SCSEL_SIZE                                   0x2
#define _ADCHS_SCSEL_LENGTH                                 0x2
#define _ADCHS_SCSEL_MASK                                   0xC
#define _ADCHS_SBSEL_POSN                                   0x4
#define _ADCHS_SBSEL_POSITION                               0x4
#define _ADCHS_SBSEL_SIZE                                   0x2
#define _ADCHS_SBSEL_LENGTH                                 0x2
#define _ADCHS_SBSEL_MASK                                   0x30
#define _ADCHS_SDSEL_POSN                                   0x6
#define _ADCHS_SDSEL_POSITION                               0x6
#define _ADCHS_SDSEL_SIZE                                   0x2
#define _ADCHS_SDSEL_LENGTH                                 0x2
#define _ADCHS_SDSEL_MASK                                   0xC0
#define _ADCHS_GASEL0_POSN                                  0x0
#define _ADCHS_GASEL0_POSITION                              0x0
#define _ADCHS_GASEL0_SIZE                                  0x1
#define _ADCHS_GASEL0_LENGTH                                0x1
#define _ADCHS_GASEL0_MASK                                  0x1
#define _ADCHS_GASEL1_POSN                                  0x1
#define _ADCHS_GASEL1_POSITION                              0x1
#define _ADCHS_GASEL1_SIZE                                  0x1
#define _ADCHS_GASEL1_LENGTH                                0x1
#define _ADCHS_GASEL1_MASK                                  0x2
#define _ADCHS_GCSEL0_POSN                                  0x2
#define _ADCHS_GCSEL0_POSITION                              0x2
#define _ADCHS_GCSEL0_SIZE                                  0x1
#define _ADCHS_GCSEL0_LENGTH                                0x1
#define _ADCHS_GCSEL0_MASK                                  0x4
#define _ADCHS_GCSEL1_POSN                                  0x3
#define _ADCHS_GCSEL1_POSITION                              0x3
#define _ADCHS_GCSEL1_SIZE                                  0x1
#define _ADCHS_GCSEL1_LENGTH                                0x1
#define _ADCHS_GCSEL1_MASK                                  0x8
#define _ADCHS_GBSEL0_POSN                                  0x4
#define _ADCHS_GBSEL0_POSITION                              0x4
#define _ADCHS_GBSEL0_SIZE                                  0x1
#define _ADCHS_GBSEL0_LENGTH                                0x1
#define _ADCHS_GBSEL0_MASK                                  0x10
#define _ADCHS_GBSEL1_POSN                                  0x5
#define _ADCHS_GBSEL1_POSITION                              0x5
#define _ADCHS_GBSEL1_SIZE                                  0x1
#define _ADCHS_GBSEL1_LENGTH                                0x1
#define _ADCHS_GBSEL1_MASK                                  0x20
#define _ADCHS_GDSEL0_POSN                                  0x6
#define _ADCHS_GDSEL0_POSITION                              0x6
#define _ADCHS_GDSEL0_SIZE                                  0x1
#define _ADCHS_GDSEL0_LENGTH                                0x1
#define _ADCHS_GDSEL0_MASK                                  0x40
#define _ADCHS_GDSEL1_POSN                                  0x7
#define _ADCHS_GDSEL1_POSITION                              0x7
#define _ADCHS_GDSEL1_SIZE                                  0x1
#define _ADCHS_GDSEL1_LENGTH                                0x1
#define _ADCHS_GDSEL1_MASK                                  0x80
#define _ADCHS_SASEL0_POSN                                  0x0
#define _ADCHS_SASEL0_POSITION                              0x0
#define _ADCHS_SASEL0_SIZE                                  0x1
#define _ADCHS_SASEL0_LENGTH                                0x1
#define _ADCHS_SASEL0_MASK                                  0x1
#define _ADCHS_SASEL1_POSN                                  0x1
#define _ADCHS_SASEL1_POSITION                              0x1
#define _ADCHS_SASEL1_SIZE                                  0x1
#define _ADCHS_SASEL1_LENGTH                                0x1
#define _ADCHS_SASEL1_MASK                                  0x2
#define _ADCHS_SCSEL0_POSN                                  0x2
#define _ADCHS_SCSEL0_POSITION                              0x2
#define _ADCHS_SCSEL0_SIZE                                  0x1
#define _ADCHS_SCSEL0_LENGTH                                0x1
#define _ADCHS_SCSEL0_MASK                                  0x4
#define _ADCHS_SCSEL1_POSN                                  0x3
#define _ADCHS_SCSEL1_POSITION                              0x3
#define _ADCHS_SCSEL1_SIZE                                  0x1
#define _ADCHS_SCSEL1_LENGTH                                0x1
#define _ADCHS_SCSEL1_MASK                                  0x8
#define _ADCHS_SBSEL0_POSN                                  0x4
#define _ADCHS_SBSEL0_POSITION                              0x4
#define _ADCHS_SBSEL0_SIZE                                  0x1
#define _ADCHS_SBSEL0_LENGTH                                0x1
#define _ADCHS_SBSEL0_MASK                                  0x10
#define _ADCHS_SBSEL1_POSN                                  0x5
#define _ADCHS_SBSEL1_POSITION                              0x5
#define _ADCHS_SBSEL1_SIZE                                  0x1
#define _ADCHS_SBSEL1_LENGTH                                0x1
#define _ADCHS_SBSEL1_MASK                                  0x20
#define _ADCHS_SDSEL0_POSN                                  0x6
#define _ADCHS_SDSEL0_POSITION                              0x6
#define _ADCHS_SDSEL0_SIZE                                  0x1
#define _ADCHS_SDSEL0_LENGTH                                0x1
#define _ADCHS_SDSEL0_MASK                                  0x40
#define _ADCHS_SDSEL1_POSN                                  0x7
#define _ADCHS_SDSEL1_POSITION                              0x7
#define _ADCHS_SDSEL1_SIZE                                  0x1
#define _ADCHS_SDSEL1_LENGTH                                0x1
#define _ADCHS_SDSEL1_MASK                                  0x80

// Register: ADCON3
#define ADCON3 ADCON3
extern volatile unsigned char           ADCON3              __at(0xF9A);
#ifndef _LIB_BUILD
asm("ADCON3 equ 0F9Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSRC                   :5;
        unsigned                        :1;
        unsigned ADRS                   :2;
    };
    struct {
        unsigned SSRC0                  :1;
        unsigned SSRC1                  :1;
        unsigned SSRC2                  :1;
        unsigned SSRC3                  :1;
        unsigned SSRC4                  :1;
        unsigned                        :1;
        unsigned ADRS0                  :1;
        unsigned ADRS1                  :1;
    };
} ADCON3bits_t;
extern volatile ADCON3bits_t ADCON3bits __at(0xF9A);
// bitfield macros
#define _ADCON3_SSRC_POSN                                   0x0
#define _ADCON3_SSRC_POSITION                               0x0
#define _ADCON3_SSRC_SIZE                                   0x5
#define _ADCON3_SSRC_LENGTH                                 0x5
#define _ADCON3_SSRC_MASK                                   0x1F
#define _ADCON3_ADRS_POSN                                   0x6
#define _ADCON3_ADRS_POSITION                               0x6
#define _ADCON3_ADRS_SIZE                                   0x2
#define _ADCON3_ADRS_LENGTH                                 0x2
#define _ADCON3_ADRS_MASK                                   0xC0
#define _ADCON3_SSRC0_POSN                                  0x0
#define _ADCON3_SSRC0_POSITION                              0x0
#define _ADCON3_SSRC0_SIZE                                  0x1
#define _ADCON3_SSRC0_LENGTH                                0x1
#define _ADCON3_SSRC0_MASK                                  0x1
#define _ADCON3_SSRC1_POSN                                  0x1
#define _ADCON3_SSRC1_POSITION                              0x1
#define _ADCON3_SSRC1_SIZE                                  0x1
#define _ADCON3_SSRC1_LENGTH                                0x1
#define _ADCON3_SSRC1_MASK                                  0x2
#define _ADCON3_SSRC2_POSN                                  0x2
#define _ADCON3_SSRC2_POSITION                              0x2
#define _ADCON3_SSRC2_SIZE                                  0x1
#define _ADCON3_SSRC2_LENGTH                                0x1
#define _ADCON3_SSRC2_MASK                                  0x4
#define _ADCON3_SSRC3_POSN                                  0x3
#define _ADCON3_SSRC3_POSITION                              0x3
#define _ADCON3_SSRC3_SIZE                                  0x1
#define _ADCON3_SSRC3_LENGTH                                0x1
#define _ADCON3_SSRC3_MASK                                  0x8
#define _ADCON3_SSRC4_POSN                                  0x4
#define _ADCON3_SSRC4_POSITION                              0x4
#define _ADCON3_SSRC4_SIZE                                  0x1
#define _ADCON3_SSRC4_LENGTH                                0x1
#define _ADCON3_SSRC4_MASK                                  0x10
#define _ADCON3_ADRS0_POSN                                  0x6
#define _ADCON3_ADRS0_POSITION                              0x6
#define _ADCON3_ADRS0_SIZE                                  0x1
#define _ADCON3_ADRS0_LENGTH                                0x1
#define _ADCON3_ADRS0_MASK                                  0x40
#define _ADCON3_ADRS1_POSN                                  0x7
#define _ADCON3_ADRS1_POSITION                              0x7
#define _ADCON3_ADRS1_SIZE                                  0x1
#define _ADCON3_ADRS1_LENGTH                                0x1
#define _ADCON3_ADRS1_MASK                                  0x80

